def dec_to_bin(num):
    # Δημιουργησε κενη λιστα
    l = list()
    # Οσο ο αριθμος num δεν ειναι 0
    while num != 0:
        # Βρες το υπολοιπο της ακεραιας διαιρεσης του αριθμου με το 2
        ypoloipo = num % 2
        # Στην λιστα l βαλε το υπολοιπο ως string, για να χρησιμοποιηθει
        # στην μεθοδο ''.join() στο κυριο μενου
        l.append(str(ypoloipo))
        # Αντικατεστησε τον αριθμο με το πηλικο της
        # ακεραιας διαιρεσης του αριθμου με το 2
        num = num // 2
    # Αντεστρεψε την λιστα l
    l.reverse()
    # Επεστρεψε την λιστα l
    return l

def bin_to_dec(num):
    # print(len(num))
    # Αρχικοποιηση αθροιστη
    dec_num = 0
    # Για καθε δυναμη i=0,..,n-1
    for i in range(len(num)):
        # Παρε το i ψηφιο (απο το τελος), μετατρεποντας το σε ακεραιο
        digit = int(num[-1 - i])
        # Αθροισε τις δυναμεις του 2
        dec_num += digit * 2 ** i
    # Επεστρεψε το αθροισμα
    return dec_num

def twos_comp(num):
    # Αρχικοποιησε το συμπληρωμα του αριθμου ως κενο string
    complementary = ''
    # Αν ο αριθμος εχει τουλαχιστον 1 μοναδα
    if '1' in num:
        # Βρες την θεση της πιο δεξια μοναδας
        pos = num.rindex('1')
        # Για καθε ψηφιο πριν τη μοναδα
        for digit in num[:pos]:
            # Προσθεσε στο συμπληρωμα το αντεστραμενο ψηφιο, δηλ
            # κανε το 0,1 και το 1,0
            complementary += str(1 - int(digit))
        # Τα ψηφια απο τη μοναδα και μετα αφησε τα ιδια
        for digit in num[pos:]:
            complementary += digit
    # Αλλιως, το συμπληρωμα ειναι ο αριθμος (0)
    else:
        complementary = num
    # Επεστρεψε το συμπληρωμα
    return complementary


# ΜΕΝΟΥ
if __name__ == "__main__":
    while True:
        print("Επιλογές")
        print("========")
        print(
            "1. Μετατροπή δεκαδικού αριθμού στο δυαδικό σύστημα, 2. Μετατροπή δυαδικού αριθμού στο δεκαδικό σύστημα, 3. Εύρεση συμπληρώματος δυαδικού αριθμού"
        )
        choice = input("Δώστε την επιλογή σας (enter για έξοδο): ")
        while choice not in ['1', '2', '3', '']:
            print("Λαθος επιλογή.")
            choice = input("Δώστε την επιλογή σας (enter για έξοδο): ")
        if choice == "":
            break
        if choice == "1":
            # Χρησιμοποιω αμυντικο προγραμματισμο για την εισοδο
            # θετικου ακεραιου αριθμου
            N = input("Δώσε έναν θετικό αριθμό: ") # N='12'
            # Οσο ο χρηστης δεν δινει θετικο ακεραιο αριθμο
            while not(N.isdigit() and int(N) > 0):
                # Ζητα του εναν θετικο ακεραιο
                N = input("Δώσε έναν θετικό αριθμό: ")
            # Εδω το string Ν εχει μεσα θετικο ακεραιο
            # Μετατρεπω το string σε ακεραιο
            N = int(N)
            # Ενωσε τα strings της λιστας που επιστρεφει η dec_to_bin
            # σε ενα ενιαιο string
            bin_li = ''.join(dec_to_bin(N))
            # Εμφανισε τον δυαδικο αριθμο bin_li
            print(f"H δυαδική αναπαράσταση του αριθμού {N} είναι {bin_li}")
        elif choice == "2":
            num = input("Δώστε ένα δυαδικό αριθμό (τα ψηφία του είναι 0 ή 1): ")
            # Οσο ο αριθμος που δινω δεν ειναι δυαδικος, δηλ δεν εχει μονο 0,1
            while set(num) not in [{"0", "1"}, {"0"}, {"1"}]:
                num = input("Δώστε ένα δυαδικό αριθμό (τα ψηφία του είναι 0 ή 1): ")
            # Σιγουρα η num εχει δυαδικο αριθμο πχ '10111011'
            # Η συναρτηση bin_to_dec καλειται και επιστρεφει τον δεκαδικο αριθμο
            dec_num = bin_to_dec(num)
            print(f"Ο αριθμός στο δεκαδικό σύστημα είναι {dec_num}")
        elif choice == "3":
            num = input("Δώστε ένα δυαδικό αριθμό (τα ψηφία του είναι 0 ή 1): ")
            # Οσο ο αριθμος που δινω δεν ειναι δυαδικος, δηλ δεν εχει μονο 0,1
            while set(num) not in [{"0", "1"}, {"0"}, {"1"}]:
                num = input("Δώστε ένα δυαδικό αριθμό (τα ψηφία του είναι 0 ή 1): ")
            # Σιγουρα η num εχει δυαδικο αριθμο πχ '10111011'
            # Η συναρτηση twos_comp καλειται και επιστρεφει το συμπληρωμα ως προς 2

            complementary = twos_comp(num)
            print(f'Το συμπλήρωμα ως προς 2 του αριθμού {num} είναι το {complementary}')
